---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
ExternalServiceOptions Properties
ExternalServiceOptions Class See Also Send Feedback
---

The ExternalServiceOptions type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsPublic | This property denotes a service as either public or private. |
|  | IsRecordable | Indicates whether executions of the service is recorded in documents or not. |
|  | IsSelfsynchronizing | Indicates whether the service's record of used services (in a particular document) can independently wary between local clients and the corresponding central model. It is then up to the service's owner to assure proper local-central synchronization. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | SupportActivation | Indicates if the service supports activation/deactivation of the servers. |

# See Also

ExternalServiceOptions Class

Autodesk.Revit.DB.ExternalService Namespace